Revit 2018 API
ApplicationEntryPoint.OpenDocumentFile Method
Overload List
Name | Description
OpenDocumentFile(String)
 Opens a document from disk.
 (Inherited from Application.)
OpenDocumentFile(ModelPath, OpenOptions)
 Opens a document from disk.
 (Inherited from Application.)
See Also
ApplicationEntryPoint Class
ApplicationEntryPoint Members
Autodesk.Revit.DB.Macros Namespace